In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [2]:
df = pd.DataFrame({
    'Employee ID': [45,78,25,56,12],
    'Gender':['Female','Male','Male','Female','Male'],
    
              })

In [3]:
df

   Employee ID  Gender
0           45  Female
1           78    Male
2           25    Male
3           56  Female
4           12    Male

In [4]:
df['Remark'] = ['Nice','Great','Good','Great','Nice']

In [5]:
df

   Employee ID  Gender Remark
0           45  Female   Nice
1           78    Male  Great
2           25    Male   Good
3           56  Female  Great
4           12    Male   Nice

In [6]:
df.Remark.unique()

array(['Nice', 'Great', 'Good'], dtype=object)

In [7]:
df.Gender.unique()

array(['Female', 'Male'], dtype=object)

In [9]:
print(df.Remark.value_counts())
print(df.Gender.value_counts())

Remark
Nice     2
Great    2
Good     1
Name: count, dtype: int64
Gender
Male      3
Female    2
Name: count, dtype: int64

In [10]:
one_hot_encoded_data = pd.get_dummies(df, columns=['Gender','Remark'])

In [11]:
one_hot_encoded_data

,Employee ID,Gender_Female,Gender_Male,Remark_Good,Remark_Great,Remark_Nice
0,45,True,False,False,False,True
1,78,False,True,False,True,False
2,25,False,True,True,False,False
3,56,True,False,False,True,False
4,12,False,True,False,False,True

## Encoding using sklearn

In [26]:
from sklearn.preprocessing import OneHotEncoder
# converting the type of column to category
df['Gender'] = df['Gender'].astype('category')
df['Remark'] = df['Remark'].astype('category')

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee ID  5 non-null      int64
 1   Gender       5 non-null      category
 2   Remark       5 non-null      category
dtypes: category(2), int64(1)
memory usage: 438.0 bytes

In [28]:
df['Gender_new'] = df['Gender'].cat.codes
df['Remark_new'] = df['Remark'].cat.codes

In [39]:
enc = OneHotEncoder()
enc_data = pd.DataFrame(enc.fit_transform(df[['Gender_new','Remark_new']]).toarray())
new_df = df.join(enc_data)

In [40]:
new_df

   Employee ID  Gender Remark  Gender_new  Remark_new    0    1    2    3    4
0           45  Female   Nice           0           2  1.0  0.0  0.0  0.0  1.0
1           78    Male  Great           1           1  0.0  1.0  0.0  1.0  0.0
2           25    Male   Good           1           0  0.0  1.0  1.0  0.0  0.0
3           56  Female  Great           0           1  1.0  0.0  0.0  1.0  0.0
4           12    Male   Nice           1           2  0.0  1.0  0.0  0.0  1.0